# -*- coding: utf-8 -*-
class Board(object):
	def __init__(self):
		self.playboard = [[2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
			, [2, 0, 0, 0, 0, 0, 0, 0, 0, 2]
			, [2, 0, 0, 0, 0, 0, 0, 0, 0, 2]
			, [2, 0, 0, 0, 0, 0,1, 0, 0, 2]
			, [2, 0, 0, 0, -1, 1, 0, 0, 0, 2]
			, [2, 0, 0, 0, 1, -1, 0, 0, 0, 2]
			, [2, 0, 0, 0, 0, 0, 0, 0, 0, 2]
			, [2, 0, 0, 0, 0, 0, 0, 0, 0, 2]
			, [2, 0, 0, 0, 0, 0, 0, 0, 0, 2]
			, [2, 2, 2, 2, 2, 2, 2, 2, 2, 2]]

	# TODO boardの表示。文字コードがよく分からない。1,-1を○とか●にしたい。
	def print_board(self):
		for num in range(0,10):
			for num2 in range(0,10):
				print self.playboard[num][num2]
